In [2]:
import pandas as pd
from pathlib import Path
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [3]:
df = pd.read_csv(Path('SJ_County_3.csv'))
df.head()

      Month  San_Joaquin_Pop  San_Joaquin_Wages  San_Joaquin_Avg_HV
0  1/1/2010           687127               3072              184440
1  2/1/2010           687729               3076              186503
2  3/1/2010           688332               3079              186375
3  4/1/2010           688934               3083              183844
4  5/1/2010           689536               3087              181471

In [4]:
df['Outcome'] = ""

In [5]:
df

         Month  San_Joaquin_Pop  San_Joaquin_Wages  San_Joaquin_Avg_HV Outcome
0     1/1/2010           687127               3072              184440
1     2/1/2010           687729               3076              186503
2     3/1/2010           688332               3079              186375
3     4/1/2010           688934               3083              183844
4     5/1/2010           689536               3087              181471
..         ...              ...                ...                 ...     ...
116   9/1/2019           774394               3996              375185
117  10/1/2019           775925               4024              375178
118  11/1/2019           777456               4052              375510
119  12/1/2019           778986               4080              377430
120   1/1/2020           780517               4108              378080

[121 rows x 5 columns]

In [6]:
df['San_Joaquin_Avg_HV'].mean()

263881.2231404959

In [7]:
df['San_Joaquin_Avg_HV'].median()

265176.0

In [8]:
df['Outcome'] = df['San_Joaquin_Avg_HV'].apply(lambda x: 0 if x <= 280000 else 1)

In [9]:
df

,Month,San_Joaquin_Pop,San_Joaquin_Wages,San_Joaquin_Avg_HV,Outcome
0,1/1/2010,687127,3072,184440,0
1,2/1/2010,687729,3076,186503,0
2,3/1/2010,688332,3079,186375,0
3,4/1/2010,688934,3083,183844,0
4,5/1/2010,689536,3087,181471,0
...,...,...,...,...,...
116,9/1/2019,774394,3996,375185,1
117,10/1/2019,775925,4024,375178,1
118,11/1/2019,777456,4052,375510,1
119,12/1/2019,778986,4080,377430,1
120,1/1/2020,780517,4108,378080,1

In [10]:
y = df["Outcome"]
X = df.drop(columns=["Month","San_Joaquin_Avg_HV","Outcome"])

In [11]:
y

0      0
1      0
2      0
3      0
4      0
      ..
116    1
117    1
118    1
119    1
120    1
Name: Outcome, Length: 121, dtype: int64

In [12]:
X

     San_Joaquin_Pop  San_Joaquin_Wages
0             687127               3072
1             687729               3076
2             688332               3079
3             688934               3083
4             689536               3087
..               ...                ...
116           774394               3996
117           775925               4024
118           777456               4052
119           778986               4080
120           780517               4108

[121 rows x 2 columns]

In [13]:
y.shape

(121,)

In [14]:
X.shape

(121, 2)

In [15]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, 
                                                    y, 
                                                    random_state=1, 
                                                    stratify=y)
X_train.shape

(90, 2)

In [16]:
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression(solver='lbfgs',
                                max_iter=200,
                                random_state=1)

In [17]:
classifier.fit(X_train, y_train)

LogisticRegression(max_iter=200, random_state=1)

In [18]:
y_pred = classifier.predict(X_test)
results = pd.DataFrame({"Prediction": y_pred, "Actual": y_test}).reset_index(drop=True)
results.head(20)

    Prediction  Actual
0            0       0
1            1       1
2            1       1
3            0       0
4            1       1
5            1       1
6            0       0
7            1       1
8            0       0
9            0       0
10           0       0
11           0       0
12           1       1
13           0       0
14           0       0
15           0       0
16           0       1
17           0       0
18           1       1
19           0       0

In [19]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_test, y_pred))

0.967741935483871

In [20]:
from sklearn.metrics import confusion_matrix, classification_report
matrix = confusion_matrix(y_test, y_pred)
print(matrix)

[[18  0]
 [ 1 12]]

In [21]:
report = classification_report(y_test, y_pred)
print(report)

              precision    recall  f1-score   support

           0       0.95      1.00      0.97        18
           1       1.00      0.92      0.96        13

    accuracy                           0.97        31
   macro avg       0.97      0.96      0.97        31
weighted avg       0.97      0.97      0.97        31